In [3]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan,'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [14]:
cleaned = data.dropna()

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = NA

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7, 3))

In [22]:
df.iloc[:4, 1] = NA

In [23]:
df.iloc[:2, 2] = NA

In [24]:
df

          0         1         2
0 -0.031909       NaN       NaN
1  0.903131       NaN       NaN
2  1.190116       NaN  0.539298
3 -0.369092       NaN  0.626892
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [25]:
df.dropna()

          0         1         2
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [26]:
df.dropna(thresh=2)

          0         1         2
2  1.190116       NaN  0.539298
3 -0.369092       NaN  0.626892
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [27]:
df.fillna(0)

          0         1         2
0 -0.031909  0.000000  0.000000
1  0.903131  0.000000  0.000000
2  1.190116  0.000000  0.539298
3 -0.369092  0.000000  0.626892
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [28]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.031909  0.500000  0.000000
1  0.903131  0.500000  0.000000
2  1.190116  0.500000  0.539298
3 -0.369092  0.500000  0.626892
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [29]:
_ = df.fillna(0, inplace=True)

In [30]:
df

          0         1         2
0 -0.031909  0.000000  0.000000
1  0.903131  0.000000  0.000000
2  1.190116  0.000000  0.539298
3 -0.369092  0.000000  0.626892
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [31]:
df = pd.DataFrame(np.random.randn(6, 3))

In [32]:
df.iloc[2:, 1] = NA

In [33]:
df.iloc[4:, 2] = NA

In [34]:
df

          0         1         2
0  0.315981  0.097579  0.859430
1 -0.759017  0.958380  0.941447
2  0.950923       NaN  1.446146
3 -1.897742       NaN -0.987770
4 -0.646025       NaN       NaN
5 -1.372841       NaN       NaN

In [35]:
df.fillna(method='ffill')

          0         1         2
0  0.315981  0.097579  0.859430
1 -0.759017  0.958380  0.941447
2  0.950923  0.958380  1.446146
3 -1.897742  0.958380 -0.987770
4 -0.646025  0.958380 -0.987770
5 -1.372841  0.958380 -0.987770

In [36]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.315981  0.097579  0.859430
1 -0.759017  0.958380  0.941447
2  0.950923  0.958380  1.446146
3 -1.897742  0.958380 -0.987770
4 -0.646025       NaN -0.987770
5 -1.372841       NaN -0.987770

In [37]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [38]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64